In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv('./data/orders.csv')
time = pd.read_csv('./data/messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   str
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), str(1)
memory usage: 31.4 KB

In [6]:
time.info()

<class 'pandas.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   str
 1   msg     1000 non-null   str
dtypes: str(2)
memory usage: 15.8 KB

In [7]:
# Converting datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [8]:
date.info()

<class 'pandas.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[us]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[us](1), int64(3)
memory usage: 31.4 KB

In [9]:
# Extract Year
date['date_year'] = date['date'].dt.year

In [10]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

In [13]:
# Extract Months
date['date_months'] = date['date'].dt.month_name()

In [14]:
date.head()

        date  product_id  city_id  orders  date_year date_months
0 2019-12-10        5628       25       3       2019    December
1 2018-08-15        3646       14     157       2018      August
2 2018-10-23        1859       25       1       2018     October
3 2019-08-17        7292       25       1       2019      August
4 2019-01-06        4344       25       3       2019     January

In [15]:
# Extract Day
date['date_day'] = date['date'].dt.day

In [16]:
date.head()

        date  product_id  city_id  orders  date_year date_months  date_day
0 2019-12-10        5628       25       3       2019    December        10
1 2018-08-15        3646       14     157       2018      August        15
2 2018-10-23        1859       25       1       2018     October        23
3 2019-08-17        7292       25       1       2019      August        17
4 2019-01-06        4344       25       3       2019     January         6

In [17]:
# Extract day of week
date['date_week'] = date['date'].dt.day_of_week

In [18]:
date.head()

,date,product_id,city_id,orders,date_year,date_months,date_day,date_week
0,2019-12-10,5628,25,3,2019,December,10,1
1,2018-08-15,3646,14,157,2018,August,15,2
2,2018-10-23,1859,25,1,2018,October,23,1
3,2019-08-17,7292,25,1,2019,August,17,5
4,2019-01-06,4344,25,3,2019,January,6,6

In [21]:
# Day of week name
date['date_week_name'] = date['date'].dt.day_name()

In [22]:
date.head()

,date,product_id,city_id,orders,date_year,date_months,date_day,date_week,date_week_name
0,2019-12-10,5628,25,3,2019,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,January,6,6,Sunday

In [24]:
# Check is weekend
date['date_is_weekend'] = np.where(date['date_week_name'].isin(['Sunday', 'Saturday']), 1,0)

In [25]:
date.head()

,date,product_id,city_id,orders,date_year,date_months,date_day,date_week,date_week_name,date_is_weekend
0,2019-12-10,5628,25,3,2019,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,January,6,6,Sunday,1

In [29]:
# Extract Quater
date['quarter'] = date['date'].dt.quarter

In [30]:
date.head()

,date,product_id,city_id,orders,date_year,date_months,date_day,date_week,date_week_name,date_is_weekend,quarter
0,2019-12-10,5628,25,3,2019,December,10,1,Tuesday,0,4
1,2018-08-15,3646,14,157,2018,August,15,2,Wednesday,0,3
2,2018-10-23,1859,25,1,2018,October,23,1,Tuesday,0,4
3,2019-08-17,7292,25,1,2019,August,17,5,Saturday,1,3
4,2019-01-06,4344,25,3,2019,January,6,6,Sunday,1,1

In [31]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

In [32]:
date.head()

,date,product_id,city_id,orders,date_year,date_months,date_day,date_week,date_week_name,date_is_weekend,quarter,semester
0,2019-12-10,5628,25,3,2019,December,10,1,Tuesday,0,4,2
1,2018-08-15,3646,14,157,2018,August,15,2,Wednesday,0,3,2
2,2018-10-23,1859,25,1,2018,October,23,1,Tuesday,0,4,2
3,2019-08-17,7292,25,1,2019,August,17,5,Saturday,1,3,2
4,2019-01-06,4344,25,3,2019,January,6,6,Sunday,1,1,1

In [34]:
# Extract time elasped between dates
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2026, 1, 25, 20, 36, 48, 209892)

In [35]:
today - date['date']

0     2238 days 20:36:48.209892
1     2720 days 20:36:48.209892
2     2651 days 20:36:48.209892
3     2353 days 20:36:48.209892
4     2576 days 20:36:48.209892
                 ...
995   2666 days 20:36:48.209892
996   2607 days 20:36:48.209892
997   2455 days 20:36:48.209892
998   2520 days 20:36:48.209892
999   2294 days 20:36:48.209892
Name: date, Length: 1000, dtype: timedelta64[us]

In [36]:
(today - date['date']).dt.days

0      2238
1      2720
2      2651
3      2353
4      2576
       ...
995    2666
996    2607
997    2455
998    2520
999    2294
Name: date, Length: 1000, dtype: int64

In [39]:
# Month Passed
np.round((today -date['date']) / np.timedelta64(1, 'D'),0)

0      2239.0
1      2721.0
2      2652.0
3      2354.0
4      2577.0
        ...
995    2667.0
996    2608.0
997    2456.0
998    2521.0
999    2295.0
Name: date, Length: 1000, dtype: float64

In [40]:
time.info()

<class 'pandas.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   str
 1   msg     1000 non-null   str
dtypes: str(2)
memory usage: 15.8 KB

In [41]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [42]:
time.info()

<class 'pandas.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[us]
 1   msg     1000 non-null   str
dtypes: datetime64[us](1), str(1)
memory usage: 15.8 KB

In [43]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [44]:
# Extract time parts
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [45]:
# Check time difference
today - time['date']

0     4424 days 19:46:48.209892
1     4288 days 20:56:48.209892
2     4774 days 20:15:48.209892
3     4076 days 20:05:48.209892
4     4473 days 21:25:48.209892
                 ...
995   5063 days 19:46:48.209892
996   4384 days 21:22:48.209892
997   4849 days 20:59:48.209892
998   4965 days 21:02:48.209892
999   4237 days 21:11:48.209892
Name: date, Length: 1000, dtype: timedelta64[us]

In [46]:
# In seconds
(today - time['date'])/np.timedelta64(1,'s')

0      3.823048e+08
1      3.705586e+08
2      4.125465e+08
3      3.522387e+08
4      3.865443e+08
           ...
995    4.375144e+08
996    3.788546e+08
997    4.190292e+08
998    4.290518e+08
999    3.661531e+08
Name: date, Length: 1000, dtype: float64

In [47]:
# In minutes
(today - time['date'])/np.timedelta64(1,'m')

0      6.371747e+06
1      6.175977e+06
2      6.875776e+06
3      5.870646e+06
4      6.442406e+06
           ...
995    7.291907e+06
996    6.314243e+06
997    6.983820e+06
998    7.150863e+06
999    6.102552e+06
Name: date, Length: 1000, dtype: float64

In [48]:
# In hours
(today - time['date'])/np.timedelta64(1,'h')

0      106195.780058
1      102932.946725
2      114596.263392
3       97844.096725
4      107373.430058
           ...
995    121531.780058
996    105237.380058
997    116396.996725
998    119181.046725
999    101709.196725
Name: date, Length: 1000, dtype: float64